// three constants:
// c - from inner Morpheus notation to standard hi
// eu - from st. hi to st.eu
// hi - from st. eu to st. hi // - when page options will allow

var c = {};

c._ = ' ';

c.ind = 'अव्यय';
c.noun = 'नाम';
c.masc = c.m = 'पु॰';
c.fem = c.f = 'स्त्री॰';
c.neut = c.n = 'नपु॰';
c.pron = 'सर्व॰';

c.num = {};
c.num[1] = 'एक॰';
c.num[2] = 'द्वित॰';
c.num[3] = 'बहु॰';

c.case = {};
c.case[1] = 'प्र॰';
c.case[2] = 'द्वि॰';
c.case[3] = 'तृ॰';
c.case[4] = 'चतु॰';
c.case[5] = 'पञ्च॰';
c.case[6] = 'षष्॰';
c.case[7] = 'सप्॰';

c.gana = {};
c.gana['01'] = '॰';
c.gana['02'] = '';
c.gana['03'] = '';
c.gana['04'] = '';
c.gana['05'] = '';
c.gana['06'] = '';
c.gana['07'] = '';
c.gana['08'] = '';
c.gana['09'] = '';
c.gana['10'] = '';


var eu = {};

eu['BG'] = 'BG';

eu['अव्यय'] = 'ind.';
eu['नाम'] = 'name:';
eu['सर्व॰'] = 'pron.';

eu['पु॰'] = 'masc.';
eu['स्त्री॰'] = 'fem.';
eu['नपु॰'] = 'neut.';

eu['एक॰'] = 'sg.:';
eu['द्वित॰'] = 'du.:';
eu['बहु॰'] = 'pl.:';

eu['प्र॰'] = 'nom.,';
eu['द्वि॰'] = 'acc.';
eu['तृ॰'] = 'inst.,';
eu['चतु॰'] = 'dat.';
eu['पञ्च॰'] = 'abl.,';
eu['षष्॰'] = 'gen,';
eu['सप्॰'] = 'loc.,';

eu['लट्'] = 'pres.,';
eu['लिट्'] = 'perf.,';
eu['लुट्'] = 'fut-likely,';
eu['लृट्'] = 'fut-certain,';
eu['लेट्'] = 'leṭ,';
eu['लोट्'] = 'imper.,';
eu['लङ्'] = 'impf.,';
// eu['लिङ्'] = 'liṅ';
eu['विधिलिङ्'] = 'poten.,';
eu['आशीर्लिङ्'] = 'bened.,';
eu['विध'] = 'poten,';
eu['आश'] = 'bened,';
eu['लुङ्'] = 'aor.,';
eu['लृङ्'] = 'cond.,';

eu['01'] = '01';
eu['02'] = '02';
eu['03'] = '03';
eu['04'] = '04';
eu['05'] = '05';
eu['06'] = '06';
eu['07'] = '07';
eu['08'] = '08';
eu['09'] = '09';
eu['10'] = '10';

eu['प'] = 'P.';
eu['आ'] = 'A.';

// var pars = ['तिप्', 'तस्', 'झि', 'सिप्', 'थस्', 'थ', 'मिप्', 'वस्', 'मस्'];
eu['तिप्'] = 'sg.3';
eu['तस्'] = 'du.3';
eu['झि'] = 'pl.3';
eu['सिप्'] = 'sg.2';
eu['थस्'] = 'du.2';
eu['थ'] = 'pl.2';
eu['मिप्'] = 'sg.1';
eu['वस्'] = 'du.1';
eu['मस्'] = 'pl.1';

// var atms = ['त', 'आताम्', 'झ', 'थास्', 'आथाम्', 'ध्वम्', 'इट्', 'वहि', 'महिङ्'];
eu['त'] = 'sg.3';
eu['आताम्'] = 'du.3';
eu['झ'] = 'pl.3';
eu['थास्'] = 'sg.2';
eu['आथाम्'] = 'du.2';
eu['ध्वम्'] = 'pl.2';
eu['इट्'] = 'sg.1';
eu['वहि'] = 'du.1';
eu['महिङ्'] = 'pl.1';

eu[''] = '';



// module.exports = c;
module.exports = {
    c: c,
    eu: eu
}

var supkeys = {
    'sg': ['1.1', '2.1', '3.1', '4.1', '5.1', '6.1', '7.1', '8.1'],
    'du': ['1.2', '2.2', '3.2', '4.2', '5.2', '6.2', '7.2', '8.2'],
    'pl': ['1.3', '2.3', '3.3', '4.3', '5.3', '6.3', '7.3', '8.3']
};

var sups = ['सु', 'औ', 'जस्', 'अम्', 'औट्', 'शस्', 'टा', 'sg.voc', 'भ्याम्', 'भिस्', 'ङे', 'भ्याम्', 'भ्यस्', 'ङसि', 'भ्याम्', 'du.voc', 'भ्यस्', 'ङस्', 'ओस्', 'आम्', 'ङि', 'ओस्', 'सुप्', 'pl.voc'];

/* verbs:
   गणाः
   लकार
*/
