//

var c = {};

c.noun = 'नाम';
c.masc = c.m = 'पु॰';
c.fem = c.f = 'स्त्री॰';
c.neut = c.n = 'नपु॰';

c.num = {};
c.num[1] = 'एक॰';
c.num[2] = 'द्वि॰';
c.num[3] = 'बहु॰';

c.case = {};
c.case[1] = 'प्र॰';
c.case[2] = 'द्वि॰';
c.case[3] = 'तृ॰';
c.case[4] = 'चतु॰';
c.case[5] = 'पञ्च॰';
c.case[6] = 'षष्॰';
c.case[7] = 'सप्॰';

c.gana = {};
c.gana['01'] = '॰';
c.gana['02'] = '';
c.gana['03'] = '';
c.gana['04'] = '';
c.gana['05'] = '';
c.gana['06'] = '';
c.gana['07'] = '';
c.gana['08'] = '';
c.gana['09'] = '';
c.gana['10'] = '';

c.pron = 'सर्व॰';

module.exports = c;

var supkeys = {
    'sg': ['1.1', '2.1', '3.1', '4.1', '5.1', '6.1', '7.1', '8.1'],
    'du': ['1.2', '2.2', '3.2', '4.2', '5.2', '6.2', '7.2', '8.2'],
    'pl': ['1.3', '2.3', '3.3', '4.3', '5.3', '6.3', '7.3', '8.3']
};

var sups = ['सु', 'औ', 'जस्', 'अम्', 'औट्', 'शस्', 'टा', 'sg.voc', 'भ्याम्', 'भिस्', 'ङे', 'भ्याम्', 'भ्यस्', 'ङसि', 'भ्याम्', 'du.voc', 'भ्यस्', 'ङस्', 'ओस्', 'आम्', 'ङि', 'ओस्', 'सुप्', 'pl.voc'];

/* verbs:
   गणाः
   लकार


*/


// - 1 - प्रथमा
    // - 2 - द्वितीया
    // - 3 - तृतीया
    // - 4 - चतुर्थी
    // - 5 - पञ्चमी
    // - 6 - षष्ठी
    // - 7 - सप्तमी
    // - सम्बोधन - 8
